**Przebudowa indeksu**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math

In [2]:
frame = pd.read_csv('C:/Users/Mariusz Baran/Data_Science_kurs/Data_science_pliki/course-files/mammals.csv')
frame.head()

              name     body  brain
0       Arctic fox    3.385   44.5
1       Owl monkey    0.480   15.5
2  Mountain beaver    1.350    8.1
3              Cow  465.000  423.0
4        Grey wolf   36.330  119.5

Zmiana indeksu

In [3]:
frame.set_index('name', inplace=True)
frame.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Cow              465.000  423.0
Grey wolf         36.330  119.5

Powrót do indeksu orginalnego

In [4]:
frame.reset_index(inplace=True)
frame.head()

              name     body  brain
0       Arctic fox    3.385   44.5
1       Owl monkey    0.480   15.5
2  Mountain beaver    1.350    8.1
3              Cow  465.000  423.0
4        Grey wolf   36.330  119.5

Nie należy zmieniać dwa razy indeksu bo spowoduje to utratę kolumny. Po pierwszej zmianie należy przywrócić indeks orginalny

Można poprawić wydajność wyszukiwania poprzez posortowanie indeksu

In [5]:
frame.set_index('name', inplace=True)
frame.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Cow              465.000  423.0
Grey wolf         36.330  119.5

In [6]:
frame.loc['Cow']

body     465.0
brain    423.0
Name: Cow, dtype: float64

In [7]:
frame.sort_index(inplace=True)
frame.head()

                               body   brain
name
African elephant           6654.000  5712.0
African giant pouched rat     1.000     6.6
Arctic fox                    3.385    44.5
Arctic ground squirrel        0.920     5.7
Asian elephant             2547.000  4603.0

In [8]:
frame.loc['Cow']

body     465.0
brain    423.0
Name: Cow, dtype: float64

W tym przypadku Python wyszukuje tylko do D

Kilka operacji na podzbiorach z data frame

In [10]:
frame['Cat':'Donkey']

                    body  brain
name
Cat                3.300   25.6
Chimpanzee        52.160  440.0
Chinchilla         0.425    6.4
Cow              465.000  423.0
Desert hedgehog    0.550    2.4
Donkey           187.100  419.0

In [11]:
frame[:'Cat']

                               body   brain
name
African elephant           6654.000  5712.0
African giant pouched rat     1.000     6.6
Arctic fox                    3.385    44.5
Arctic ground squirrel        0.920     5.7
Asian elephant             2547.000  4603.0
Baboon                       10.550   179.5
Big brown bat                 0.023     0.3
Brazilian tapir             160.000   169.0
Cat                           3.300    25.6

In [12]:
frame['A':'C']

                               body   brain
name
African elephant           6654.000  5712.0
African giant pouched rat     1.000     6.6
Arctic fox                    3.385    44.5
Arctic ground squirrel        0.920     5.7
Asian elephant             2547.000  4603.0
Baboon                       10.550   179.5
Big brown bat                 0.023     0.3
Brazilian tapir             160.000   169.0